myrottenpotatoes/app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def create
    params.require(:movie)
    permitted = params[:movie].permit(:title,:rating,:release_date)
    @movie = Movie.create!(permitted)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["rating", "G"], ["release_date", "2017-12-24 00:00:00"], ["created_at", "2017-12-24 00:29:58.031326"], ["updated_at", "2017-12-24 00:29:58.031326"]]